# ------------------------------ PART 7 --------------------------------

# # loc()

In [20]:
import pandas as pd

In [21]:
df = pd.read_csv(r'C:/Users/Admin/Desktop/PythonProject/pandastutorial/Datasets/sample2.csv',
                 index_col = ['Roll No.'])
df.head()

         Branch  Physics  Chemistry  Maths  Computer         DOB
Roll No.
1            CS     56.0       57.0   58.0      59.0  01-01-2001
2           ECE     23.0       24.0   25.0      26.0  02-01-2001
3          MECH     89.0       25.0   26.0      27.0  03-01-2001
4          MECH     45.0       26.0   27.0      28.0         NaN
5            CS     23.0       27.0   28.0      29.0  05-01-2001

In [22]:
df.iloc[1]

Branch              ECE
Physics              23
Chemistry            24
Maths                25
Computer             26
DOB          02-01-2001
Name: 2, dtype: object

In [23]:
df.iloc[5]

Branch              ECE
Physics              90
Chemistry           NaN
Maths                29
Computer             30
DOB          06-01-2001
Name: 6, dtype: object

In [24]:
df.loc[[5,6,7,8]]

         Branch  Physics  Chemistry  Maths  Computer         DOB
Roll No.
5            CS     23.0       27.0   28.0      29.0  05-01-2001
6           ECE     90.0        NaN   29.0      30.0  06-01-2001
7            CS     12.0       13.0   14.0      15.0  07-01-2001
8           NaN     78.0       14.0   15.0      16.0  08-01-2001

In [25]:
df.loc[5, 'Physics']

23.0

In [27]:
df.loc[5:15, 'Chemistry']

Roll No.
5     27.0
6      NaN
7     13.0
8     14.0
9     15.0
10    16.0
11    17.0
12     NaN
13    23.0
14     NaN
15    43.0
Name: Chemistry, dtype: float64

In [28]:
df.loc[df['Physics']<50]

         Branch  Physics  Chemistry  Maths  Computer         DOB
Roll No.
2           ECE     23.0       24.0   25.0      26.0  02-01-2001
4          MECH     45.0       26.0   27.0      28.0         NaN
5            CS     23.0       27.0   28.0      29.0  05-01-2001
7            CS     12.0       13.0   14.0      15.0  07-01-2001
10           CS     45.0       16.0   17.0      18.0  10-01-2001
13           CS     22.0       23.0   24.0      25.0  13-01-2001
16          NaN     44.0       44.0   44.0      44.0  16-01-2001
17         MECH     45.0       45.0   45.0      45.0  17-01-2001
18         MECH     46.0       46.0   46.0      46.0  18-01-2001
19          ECE     47.0       47.0   47.0      47.0         NaN
20         MECH     48.0       48.0   48.0      48.0  20-01-2001
21         MECH     49.0       49.0   49.0      49.0  21-01-2001

In [31]:
df.loc[df['Physics']>80]

         Branch  Physics  Chemistry  Maths  Computer         DOB
Roll No.
3          MECH     89.0       25.0   26.0      27.0  03-01-2001
6           ECE     90.0        NaN   29.0      30.0  06-01-2001
12           CS     88.0        NaN   19.0      20.0  12-01-2001
14           CS     90.0        NaN    NaN      42.0  14-01-2001

In [36]:
df.loc[df['Physics']>80, ['Maths']]

          Maths
Roll No.
3          26.0
6          29.0
12         19.0
14          NaN

# #  iloc()

In [37]:
df.iloc[0]

Branch               CS
Physics              56
Chemistry            57
Maths                58
Computer             59
DOB          01-01-2001
Name: 1, dtype: object

In [38]:
df.iloc[[0]]

         Branch  Physics  Chemistry  Maths  Computer         DOB
Roll No.
1            CS     56.0       57.0   58.0      59.0  01-01-2001

In [39]:
df.iloc[:,0]

Roll No.
1       CS
2      ECE
3     MECH
4     MECH
5       CS
6      ECE
7       CS
8      NaN
9      ECE
10      CS
11     ECE
12      CS
13      CS
14      CS
15     ECE
16     NaN
17    MECH
18    MECH
19     ECE
20    MECH
21    MECH
22    MECH
23     ECE
24    MECH
25    MECH
26     ECE
27      CS
28      CS
29      CS
30      CS
Name: Branch, dtype: object

In [40]:
df.iloc[:,1]

Roll No.
1     56.0
2     23.0
3     89.0
4     45.0
5     23.0
6     90.0
7     12.0
8     78.0
9      NaN
10    45.0
11     NaN
12    88.0
13    22.0
14    90.0
15     NaN
16    44.0
17    45.0
18    46.0
19    47.0
20    48.0
21    49.0
22    50.0
23    51.0
24    52.0
25    53.0
26    54.0
27    55.0
28    56.0
29    57.0
30    58.0
Name: Physics, dtype: float64

In [41]:
df.iloc[0:5, 1]

Roll No.
1    56.0
2    23.0
3    89.0
4    45.0
5    23.0
Name: Physics, dtype: float64

In [42]:
df.iloc[0:5, 1:4]

          Physics  Chemistry  Maths
Roll No.
1            56.0       57.0   58.0
2            23.0       24.0   25.0
3            89.0       25.0   26.0
4            45.0       26.0   27.0
5            23.0       27.0   28.0